# LayerCapFlag Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructureLayer..::..LayerCapFlag Property
CompoundStructureLayer Class See Also
---
Identifies if the layer participates in wrapping at end caps and/or inserts.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool LayerCapFlag { get; set; }
```

Visual Basic
---
```text
Public Property LayerCapFlag As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool LayerCapFlag {
	bool get ();
	void set (bool value);
}
```

# ### Field Value
True if the layer participates in wrapping, false otherwise. It is meaningful only for Shell layers (for Core layers, the value is always true). The default value is true.
# See Also
CompoundStructureLayer Class
Autodesk.Revit.DB Namespace